#1
slaim_bro_t = ['я Крутой Слайм Игорь','ой то есть привет',
               'я защитник этой ярмарки','тебе проход запрещён',
               'Проиграв битву я не пал','в борьбе я до конца',
               'но пока я жив','тебя дальше не пущу',
               'в битве я сверкал','победы свет в моих очках',
               'так ярко отразился, что','тебя он ослепил',
               'у тебя есть пропуск','странно, ну проходи',
               'только не ослепни','от моей крутости']

witch_t = ['здравствуй, воин','меня звать Анастасия',
           'вижу тебя потрепали, советую','окружением востановиться',
           'за что.. ?','я просто хотела помочь',
           'прошу не убивай','я уйду.. честно',
           'что ты творишь?','это тренировка?',       
           'очень глупо, но я','буду ждать тебя в лесу',    
           'вижу ты в порядке','я знаю твои намеренья',
           'востановить.. будет трудно','ступай в лес, там продолжим']

slaim_t = ['Грх.. какой же он..','..К.С.И самовлюблённый.. грх',
           'о ты, давай сразимся','победишь пропущу',
           'я не размялся.. и вообще','тебе просто повезло',
           'не убивай меня','иди дальше, пропускаю',
           'знай же имя победителя','который одолел тебя',
           'меня зовут фираз','сразимся ещё раз?',
           'ты убил его','его больше нет.. ура!',
           'ой.. то есть эх..','как мне жалко брата']

assistant_t = ['даров','я ассестенка этой мадам',
               'меня звать Сенька','поговори с Анастасией',
               'дурак','что ты делаешь?',
               'я ничего не сделала','вот так я кончу?',
               'ты человек..','который не понимает',
               'всю силу свою, но я помогу','тебе понять свою силу',
               'как ассестентка Анастасии','хочу тебе напомнить',
               'окружение странное?','ломай! добивай и сокрушай!']

#2
assistant_2t = ['тс.. я знаю, что','за мной наблюдают',
                'можешь его убить?','обещаю хорошую награду',
                'что ты тваришь?','моя вера в тебя',
                'полностью убита, ты','полностью слеп',
                'что.. гад!','сделаю вид что..',
                'ты очень глупый','иди убивать!',
                'ого удивил ты меня','я боялась, что ты..',
                'вот возьми свиток воина','оно тебя усилит']

ninja_t = ['тс.. тихо, привет','Моё прозвище Хомяк',
           'Больше я ничего не скажу','Странно.. ступай!',
           'ты победил..','я должен умереть..',
           'прошу добей меня..','иначе.. ты умрёшь..',
           'ты проиграл..','я должен был..',
           'лучше уходи..','мешаешь очень..',
           'ты её убил?','спасибо.. но зачем?',
           'я пойду дальше','ещё увидимся.. напарник?']

bro_t = ['брат бесит!','о привет достопочтенный',
         'я не хочу беседовать','досвидания',
         'эй.. ты монстр','не смей меня трогать!',
         'Рамиз помоги!','я хочу жить',
         'братец..','я тебя спасу',
         'если мы умрём','то только вместе!',
         'брат.. он мёртв..','ты ужасен!',
         'не уж то мы','заслуживаем смерти?']

bro2_t = ['как же сестра злит!','привет герой',
          'моя сестра доказывает','мне, что я лох!',
          'ты.. монстр','жажда движет тобой',
          'Моншел, прошу тебя','беги..',
          'ты отброс отойди','от моей сестры',
          'я не отступлю','готовся умереть!',
          'се..стра..','а всё же..',
          'я умер уже.. заберу','я тебя с собой?']

#3
ninja_2t1 = ['Уберайся от сюда','Предупреждаю начав бой',
            'я готов убить тебя','Во имя Метасуса!',
            'ты победил.. ?','к сожалению.. да',
            'я проиграл.. ?','верно..',
            '-','-',
            '-','-']
ninja_2t2 = ['Ты победил номера 3?','Мы номер 2 и 4',
            'не пропустим тебя','Во имя Метасуса!',
            'ты победил.. ?','эх.. да',
            'мы проиграли.. ?','наверное..',
            'Эх..','Ты серьёзно открыл?',
            'Один слайм ничего бы','не смог!']
ninja_2t3 = ['Ты победил 3.. идея!','Давай сделку? ты победишь',
            'слайма беглица, а мы','откроем секретный проход',
            'вы победили.. ?','ну.. верно',
            'эх.. проиграли.. ?','скорее всего..',
            'Как обещал, проход открыт','ты человек чести',
            'надо будет..','хотя забудь и иди']

slaim_2t = ['тс.. привет','моё прозвище мистер свин',
            'мою деревню захватили, снова','..прошу спаси нас ещё раз!',
            'хех.. смешно..','герой стал злодеем',
            'ты за них?','жаль..',
            'за мной должок, спасибо!','после твоего ухода люди',
            'сошли сума! ну ладно..','прощай, герой!']
slaim_farmer_t = ['привет, я илья устинов','я единственный фермер',
            'как тебе кабачки мои?','прошу не трогай их',
            'мои..ка..ба..чки..','я не защитил вас',
            'как тебе не стыдно?','что они сделали?',
            'только тронь ещё раз','эти прекрасные кабачки',
            'и я тебя превращу в','навоз для кабачков']

tree_slaim_2t1 = ['хорошего дня','вы нам очень помогли', 
                  'спасибо большое за спасение!','давно вас не видел тут',
                  'вы хуже их..','вы нас убьёте?',
                  'всё же вы злой','или хуже..']
tree_slaim_2t2 = ['приветствую','вы помогли нам!', 
                  'спасибо, снова..','ещё раз спасибо!',
                  'вы монстр..','вы меня убьёте?',
                  'вы правдо злой..','может и хуже..']
tree_slaim_2t3 = ['здравствуй','благодарю вас, но..', 
                  'у меня есть вопросы','обсудим позже?',
                  'вы.. не вы..','это не вы.. вы..',
                  'вы.. были.. героем..','вы.. стали злодеем!']

#4
witch_t2 = ['для нашего плана','нужен маг огня, который',
           'нам поможет ослабить','главную опасность на пути',
           'а знаешь что?','я не помогу тебе',
           'а я верила в тебя..','оказалось ты.. да..',
           'Не трожь мага!','я же уже заплатила!',
           'видно он не поможет','пошли дальше.. герой?',
           'к сожалению, кое кто','не сможет нам помочь',
           'по этому не задерживайся','вперёд в путь!']

people_1t1 = ['привет изгнаный','ты не много изменился',
              'но улыбка всё таже','как тебе деревушка?',
              'эй, за что.. ?','ты точно ли ты?',
              'раньше ты был другим','но сейчас.. не ты..',
              'вот и закончился хаус','не знаю что бы я делал',
              'не уверен что выжил бы..','спасибо.. герой!',]
people_2t1 = ['привет изгнаный герой','добро пожаловать в',
              'деревню алгоритмика','рад.. что ты жив..',
              'выключиться лампочка','погаснет свеча',
              'потухнет огонь','испариться душа',
              'фух.. изгнаный герой','благодарю тебя',
              'всё же это ложь!','я верил! я чувствовал!',]
people_3t1 = ['привет кто бы ты ни был','кажешься знакомым..',
              'а это же ты тогда','пытался убить короля?',
              'ты тупой злодей','убирайся от сюда',
              'беги пока я добр','иначе казню тебя',
              'я сильно удивлён','ты вроде же злодей',
              'типо воскресший труп','убитого героя или нет?',]

people_t1 = ['изгнаный прошу помоги','меня звать Молавис',
           'быстрее вступи в бой','я долго не выдержу',
           'благодарю вас','я отдохну не много',
           'и пойду проверю деревню','на наличия этих гадов']
people_t2 = ['изгнаный прошу помоги','меня звать сергей',
           'вступи в бой','я уже ранен!',
           'спасибо большое','я очень устал..',
           'прошу спаси деревню','эх.. смертельно устал..']
people_t3 = ['эй ты помоги..','меня звать артур',
           'я не хочу умирать','прошу! пожалуйста..',
           'ой.. фух. спасиб','не знаю, что сказать..',
           'странно всё это..','ты же вроде плохой..']

people_t1_1 = ['благодарю вас..','но вы опаздали..',
           'он сбежал от нас!','это была месть.. ?',
           'кажется я умираю?','меня.. кх.. Молавис..',
           'ты опаздал, я навсегда..','скора закрою глаза']
people_t2_1 = ['спасибо.. большое тебе..','но они ушли разграбив нас..',
           'они отомстили нам?','только за что?',
           'кх.. кх..','я вижу ангела..',
           'скора я и смерть сойдёмся','в танце на всегда',]
people_t3_1 = ['попытка не плохая','но глупая.. хех',
           'злой герой или герой злой?','задумайся над этим',
           'вот и конец..','я старался! я сражался!',
           'я пытался.. я устрашал..','я, да я.. я..']

worm_t = ['Грх грых Гыррр','Гыыыррх хыр ррр',
        'ыррхх гыррр рррр','ыхх грх ххррр',
        'гр.. грх хыр!','хргыы гы хыррыы',
        'рыгг грыы грх.. хр','грых.. гры.. г..']

fire_mag_t = ['здравствуй, я максим флик','маг огня 5 уровня',
           'за это мне хорошо заплатят','поэтому я тебе помогу',
           'червь потухший и неблагодарный','помощи от меня не жди!',
           'кусок тупого угля!','сожена твоя душа!',
           'эм.. ладно..','значит идём вдвоём?',
           'странно, ну.. плата..','ну наверное пошли?']
fire_mag_t1 = ['здравствуй, я флик','сильный маг огня 5-го уровня',
           'не обращай внимания','я готовлюсь к победе..',
           'что бы ты сгорел!','ты нарушил мой план!',
           'кусок тупого угля!','черная твоя душа!',
           'здравствуй, я флик','сильный маг огня 5-го уровня',
           'не обращай внимания','я готовлюсь к победе..',]
#5
fire_mag_t2_1 = ['я смогу победить','надо только подождать',
           'о и ты здесь?','прошу тебя не мешай',
           'что бы ты сгорел!','ты нарушил мой план!',
           'кусок тупого угля!','черви мои вперёд!']
fire_mag_t2_2 = ['ты убил моих червей!','как ты смел мешать!',
           'я поставлю наши жизни','только один из нас выживет!',
           'огонь.. магия..','они плянили меня..',
           'прошу не трожь меня','я навсегда уйду..']
#6
ninja_evil_t = ['спасибо что не слушал его','знаешь как мне хорошо!',
           'прости, но для жизни мне','нужен новый владелец!',
           'это труп ниндзя Хомяка','лучше его не трогать',
           'видимо его маска тогда','взяла контроль над мёртвым']
#7
witch_t3 = ['вот и настало время..','но есть одна проблема',
           'твой дружок нам мешает','он нас не пропустит..',
           'и вот за что?','зачем и почему?',
           'что тобой движет?','месть.. или что-то хуже',
           'ты справился!','фух.. я переживала',
           'пошли дальше, он..','должен быть там']

assistant_t3 = ['хм.. а тебе не кажется','странным.. почему они',
                'тебе помогают? может','устраним их?',
                'эх.. не смогла я','открыть твои глаза..',
                'ну и будь слеп','не умеющий видеть',
                'никого нет с нами','пошли дальше вместе',
                'я помогу тебе','как ты мне помог']

fire_mag_t3 = ['этот воин явно','не даст нам пройти',
          'как идея разобраться','с этой проблемой',
          'мои черви умнее тебя!','за что.. уголь!',
          'созжен ты будешь','полностью до тла!',
          'ну вот теперь лучше','пошли быстрее',
          'не хочу задерживаться','пора в бой!']

knight_t = ['давно не виделись','ты как будто помертвел',
             'ну же ты понимаешь, что','вам проход запрещён',
             'ты остался сильным','но ты сражаешься по другому',
             'телом это ты, верно','но душой, кто то другой',
             'давно не виделись','изменился же ты',
             'прости мой друг','проход тебе закрыт']

#8
witch_t4 = ['приготовься!','скора пойдём в бой',
           'не смей проиграть!','иначе.. будет плохо',
           'я верила в тебя','честно.. верила',
           'что ты герой, но','ты не наш герой']

assistant_t4 = ['сделай так, что бы','мы пошли одни в бой',
                'и тогда поверь мне','им не жить',
                'моя вера пала..','мне казалось ты..',
                'не тряпка и не тупой!','как ты посмел!',
                'вот мы и одни','готовься это сражение',
                'будет сложным.. но мы','вместе выйграем!']

fire_mag_t4 = ['пятьсот один золотой.. ой','ты.. то есть готовься',
          'битва трудная.. наверное','ну я точно не знаю',
          'погасни полностью!','сгори же ты до тла!',
          'превратись в пепел!','ложный кто то там!']
#9
witch_t5 = ['готовься, сейчас мы','должны не проиграть',
           'придётся постараться','времени нет, вперёд!',
           '','',
           '','',
           'мы молодцы','я останусь тут',
           'удачи тебе, не..','то есть айзен']

assistant_t5 = ['не надеяся на мою','помощь, ведь ты не смог',
               'их убить, поэтому','я пожалуй отдохну',
               'критин!','без меня ты никто!',
               'хотя.. ты и душой','полное ненастоящие ничтожество!',
               'вот мы и здесь','стража мертва',
               'мага прикончим вместе','одна я не справлюсь']

fire_mag_t5 = ['стражу мы победим!','а если проиграем..',
          'то.. я хочу в тёмную камеру..','с хорошей столовой',
          '','',
          '','',
          'мы справились','я всё сделал, по плану',
          'и пожалуй отдохну','а потом уйду']

mag_t = ['я мунтр, защищу короля','от тебя лже айзен',
          'тебя прошлого нет','я убью эту оболочку',
          'если душа тебя прошлого','внутри тебя, то прости',
          'за то что не спас','твоё тело...',
          'может в твоём теле..','остался ещё тот ты.. ?',
          'если да.. прошу пройди','в замок.. на разговор']

knight2_t = ['командир..','нам придётся исполнить',
          'ваше правило номер 1','предателей убей..',
          'мы проиграли..','мы не исполнили',
          'ваш указ.. полностью..','простите нас..']
knight3_t = ['хороший товарищ..','нам придётся исполнить',
          'твою просьбу.. мы остановим','тебя от ошибки',
          'эх.. проиграли..','мы не исполнили',
          'твою просьбу.. полностью..','прости ты нас..']
#10-...
king_t = ['приветсвую тебя оживлённый','хочу с тобой поговорить',
          'пройди дальше в зал 1','к сожалению, я всё понимаю..',
          'значит ты убить меня хочешь','не буду многословен',
          'я не хочу убивать тело','героя, которого я не спас',
          '','',
          '','']

obelisk_t0 = ['грибное племя покинуло эти','земли, но в будущем они',
             'обещали вернуться','назад на грибную родину']
obelisk_t0_2 = ['ярмарка закончилась','кажется охраник об этом',
             'не знал, но скоро будет','новая большая ярмарка']
obelisk_t1 = ['странно..','но эти руны и столбы..',
             'единственное что я помню','точно ли я.. я?']
obelisk_t2 = ['тут написанно что то','про воскрешение героя',
             'героя которого все знали','интересная легенда']
obelisk_t3 = ['а тут написанно про','загипнотизиронного героя',
             'и про его борьбу','он сбежал с замка и умер']
obelisk_t4 = ['замок очень большой внутри','но кажется всё закрыто',
             'надо будет найти ключи','в будующем']
obelisk_t = [obelisk_t1,obelisk_t2,obelisk_t3,obelisk_t0,obelisk_t0_2,obelisk_t4]
moon_t = ['сохраниться?','',
          '','',
          'прогресс сохранён','',
          '','']

text_e = [[
         #поздравление с прохождением
         'поздравляю с прохождением игры','давай узнаем что случилось',
         'в этом мире за время твоей','игры и жизни..(для продолжения нажми: к)',

         #слаймы
         'Слайм Игорь увлёкся некромантией','ради попытки воскресить брата',
         'спустя 22 месяца, во время ритуала','он допустил смертельную ошибку...',

         'Тела двух мёртвых братьев','спустя очень долгое время',
         'стекли в ближайшую реку','слившись в одно целое',

         'Один из братьев слаймов','был рад смерти другого',
         'его счастье длилось долго','пока работать не пришлось..',

         'Оба слайма живы','но ненависть одного из них к другому..',
         'прогресировала в полной тишине','и в чужой тени другого..',

         #деревня людей
         'с деревней людей ничего не случислось','люди живут как жили',
         'но некоторым из жителей','не понравился ваш характер',

         'Деревня благодарит вас за помощь','люди начали слагать легенды',
         'о фенексе герое, прешедшим','на помощь в схватке',

         'Деревня людей сгорела до тла..','выжили лишь некоторые люди',
         'по их словам, они своими страданиями','откупились за прошлое поколение',

         #деревня слаймов
         'деревня слаймов захвачена','отряд метасуса победил',
         'им пришлось убить фермера, ведь','он от злости убил пол отряда',

         'лесные слаймы благодарны вам','они думают, что вас окливетали..',
         'ведь вы спасли их деревню','вы останитесь для них героем',

         'лесные слаймы в сомнениях','вроде вы освободитель, а вроде убица',
         'который убил некоторых жителей','вы не герой, но и не злодей',

         #возвращение к нам
         'но.. давайте вернёмся к нам','что же произошло с нами?',
         'стали новым королём', 'пришли вновь на службу', 'стали помошником новой королевы',
         
         #концовка 1: правление
         'придя на трон, заменив прошлого короля','о вас высказывались многие',
         'кто то говорил хорошее','а кто то не очень хорошее',
     
         'Но по итогу оказалось больше тех','кто был рад вашему правлению',
         'тех кто уважали вас как короля','вы стали хорошим правителем!',

         'Но по итогу оказалось больше','недовольных вами как королём',
         'народ бастовал, но по итогу','вы были натроне 12 лет',

         #концовка 2: суд
         'К вашему сожалению, короля','заставили провести суд над тобой',
         'перед принятием на службу..','перед принятием в королевство',

         'По итогу суда','вы приняты на службу',
         'причём сразу в командиры','король был рад этому',

         'И по итогу суда','вы смогли вернуться в народ',
         'но на службу попасть не смогли','нуу строить дома тоже не плохо',

         'И после суда..','вас приговорили к тюрьме',
         'вы должны отбыть наказание','перед принятием в народ',

         #концовка 3: служба
         'Ассистентка стала новой королевой','а вы её правой рукой',
         'хотя правильно сказать кинжалом','уничтожавшим нежелательных персон',

         'вы думаю не хотели такого','вроде живёте в роскоши, но',
         'быть всего лишь пешкой..','на мечту не похоже',

         #новая игра?
         'так и закончилось ваше приключение','может хочешь поменять что-то?'
         ],
        ['ты открыл секретную концовку:','"это были грибы ли"',
         'запомни, все грибы есть нельзя','и лучше есть вырасшие грибы'],
        ['ну что сказать секретная концовка:','"Елены лес, а не твой!"',
         'как себя чувствуюте?','вы убили много растений, а они вас..'],
        ['открыта секретная концовка:','"лашко плохой строитель"',
         'да.. всё держалось только','на хрупких 6 колоннах..'],
        ['открыта секретная концовка:','"побег с поля боя"',
         'вы убежали и начали спокойную жизнь..','жизнь обычного дровосека'],
        ['открыта секретная концовка:','"проигрыш в финальном бою"',
         'знаете в тюрьме не так уж плохо','по пятницам дают блинчики']
         ]